In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')
#Here we are not using squeeze or uscols type attribute and 
#by looking at the data set it is clear that it contains missing value NaN
#we are going to pre process this before actual modelling.
nba.head()
# nba.tail(10)

In [ ]:
nba.index
nba.shape
nba.dtypes
# # # # # #Below are some attributes which are made for Dataframes only
nba.columns
nba.axes
nba.info
nba.info()

In [ ]:
nba.get_dtype_counts()

# shared method and column access in pandas

In [ ]:
import pandas as pd
rev=pd.read_csv('revenue.csv', index_col='Date')
rev.head()

In [ ]:
# rev.sum() #Here data is added in terms of column wise
# rev.sum(axis=0)
rev.sum(axis='index')

In [ ]:
# rev.sum(axis=1)
rev.sum(axis='columns')

In [ ]:
nba=pd.read_csv('nba.csv')
nba.head()

#If i want to extract data column wise
# type(nba.Salary) #Its data type is series as it is a single dimension array it works properly when there is no space in column name

In [ ]:
type(nba.Name)

In [ ]:
# nba['Name'] #It is more accurate as it works for those column also which have space in there name
nba.Name

In [ ]:
# nba[['Team', 'Name']]
select=['Team', 'Name']
nba[select]

# Add new column to data frames

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

In [ ]:
nba['Sports']='Basket Ball' #One method to add column but by this column is added at the last
nba.head()

In [ ]:

nba=pd.read_csv('nba.csv')
#Insert method : any specific place you may add your column
nba.insert(3, column="League", value="IPL")
nba.League[[0,1]]=["Hello","test"]
nba.head()

# BroadCasting operation in pandas

In [23]:
#Broadcasting : means to perform operation in whole series of a column
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [24]:
#nba['Salary'].sub(50000)
# nba['Salary']-50000


# nba['Age'].add(5)
# nba['Age']+5


# nba['Weight'].mul(0.453)
# nba['Weight']*0.453



nba["Weight in KG"]=nba['Weight']*0.453592
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Weight in KG
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,81.646560
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,106.594120
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,92.986360
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,83.914520
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,104.779752

In [ ]:
# Drops Rows with Null Values

In [6]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [ ]:
nba.tail()

In [15]:
nba.dropna()
# nba.dropna(how='any', inplace = True)
#nba.dropna(how='all', inplace=True)
nba.tail()

             Name       Team  Number Position   Age Height  Weight
452    Trey Lyles  Utah Jazz    41.0       PF  20.0   6-10   234.0
453  Shelvin Mack  Utah Jazz     8.0       PG  26.0    6-3   203.0
454     Raul Neto  Utah Jazz    25.0       PG  24.0    6-1   179.0
455  Tibor Pleiss  Utah Jazz    21.0        C  26.0    7-3   256.0
456   Jeff Withey  Utah Jazz    24.0        C  26.0    7-0   231.0

In [12]:
nba.dropna(axis=1, inplace=True) #It deletes column which consists NaN
nba.head()

            Name            Team  Number Position   Age Height  Weight
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

In [ ]:
nba.dropna(subset=['Salary'])

# fillna method for Null Values

In [16]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [17]:
nba.fillna().head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,0,5000000.0

In [ ]:
nba['Salary']
nba['Salary'].fillna(0, inplace=True)
nba.head()

In [ ]:
nba['College'].fillna('No College', inplace=True)
nba

# sort_values() method in Data Frames

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

In [19]:
nba.sort_values('Name', ascending=False).head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
237,Zaza Pachulia,Dallas Mavericks,27.0,C,32.0,6-11,275.0,NaN,5200000.0
271,Zach Randolph,Memphis Grizzlies,50.0,PF,34.0,6-9,260.0,Michigan State,9638555.0
402,Zach LaVine,Minnesota Timberwolves,8.0,PG,21.0,6-5,189.0,UCLA,2148360.0
270,Xavier Munford,Memphis Grizzlies,14.0,PG,24.0,6-3,180.0,Rhode Island,NaN
386,Wilson Chandler,Denver Nuggets,21.0,SF,29.0,6-8,225.0,DePaul,10449438.0

In [ ]:
nba.sort_values('Age')
nba.sort_values('Age', ascending=False)

In [ ]:
nba.sort_values('Salary') #NaN values would arrange at the end
# nba.sort_values('Salary', na_position='last')
nba.sort_values('Salary', na_position='first')

# sortvalues() for multi columns in pandas

In [20]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [22]:
nba.sort_values(['Name', 'Team'])
# nba.sort_values(['Team', 'Name'], ascending=[True,False])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
152,Aaron Brooks,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0
356,Aaron Gordon,Orlando Magic,0.0,PF,20.0,6-9,220.0,Arizona,4171680.0
328,Aaron Harrison,Charlotte Hornets,9.0,SG,21.0,6-6,210.0,Kentucky,525093.0
404,Adreian Payne,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0
...,...,...,...,...,...,...,...,...,...
270,Xavier Munford,Memphis Grizzlies,14.0,PG,24.0,6-3,180.0,Rhode Island,NaN
402,Zach LaVine,Minnesota Timberwolves,8.0,PG,21.0,6-5,189.0,UCLA,2148360.0
271,Zach Randolph,Memphis Grizzlies,50.0,PF,34.0,6-9,260.0,Michigan State,9638555.0
237,Zaza Pachulia,Dallas Mavericks,27.0,C,32.0,6-11,275.0,NaN,5200000.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# rank() method in pandas

In [30]:
import pandas as pd
nba=pd.read_csv('nba.csv').dropna(how='all')
nba['Salary']=nba['Salary'].fillna(0).astype('int')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000

In [33]:
#I want to decide on the basis of salary, that whose salary is highest comes at rank 1 and so on..
nba['Salary'].rank()
# nba['Salary'][91]
#nba['Salary'].rank(ascending=False).astype(int)
nba['Salary Rank']=nba['Salary'].rank().astype(int)
#nba.sort_values(by='Salary', ascending=False)
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Salary Rank
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337,361
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117,348
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0,6
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640,136
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000,311

# Filtering DataFrames in pandas

In [34]:
import pandas as pd
df=pd.read_csv('employees.csv')
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [35]:
df.info() #at the end size is there, when we look at the output it is claer that start date and last login time data type is object, but actually they are object iof adte time same as in Senior management has object type but actually it is bool and if correct data type is not there then more memory is required

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [36]:
df['Start Date']

0        8/6/1993
1       3/31/1996
2       4/23/1993
3        3/4/2005
4       1/24/1998
          ...
995    11/23/2014
996     1/31/1984
997     5/20/2013
998     4/20/2013
999     5/15/2012
Name: Start Date, Length: 1000, dtype: object

In [38]:
# pd.to_datetime(df['Start Date'])
df['Start Date']=pd.to_datetime(df['Start Date'])

In [39]:
df['Last Login Time'].head()

0    12:42 PM
1     6:53 AM
2    11:17 AM
3     1:00 PM
4     4:47 PM
Name: Last Login Time, dtype: object

In [ ]:
# pd.to_datetime(df['Last Login Time'])
df['Last Login Time']=pd.to_datetime(df['Last Login Time'])

In [40]:
df['Senior Management']=df['Senior Management'].astype(bool)

In [41]:
df['Gender']=df['Gender'].astype('category')

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 49.1+ KB

In [ ]:
#date time can be converted by attribute parse_date available in read_csv method
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.info()

# Filtering a dataframe based on condition

In [ ]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

In [ ]:
#If i want to apply condition on gender that i want only those value in gender series which are of male category
# df['Gender']
df['mask']=df['Gender']=='Male'
# df
# df[mask]
# df[df['Gender']=='Female'] #This will extract only those value in a column whose value are male

In [ ]:
mask1=df['Team']=='Finance'
mask2=df['Gender']=='Male'

# df['Filter']=df[mask1 & mask2]
df[mask1]
df[df['Team']=='Finance']

In [ ]:
mask=df['Senior Management']
# df[df['Senior Management']] #As senior management data is already in boolean so it can be done directly'
df[mask]

In [ ]:
mask= df['Team'] != 'Marketing'
df[mask]
# df[df['Team'] != 'Marketing'] #condition for not equal to.

In [ ]:
df[df['Salary']>110000]

# Filter Data Frame with AND & OR Operators

In [ ]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

In [ ]:
mask1=df['Gender']=='Male'
mask2=df['Team']=='Marketing'

df[mask1 & mask2]

df[mask1 & mask2].head()

In [ ]:
mask3=df['Senior Management']
mask4=df['Start Date']< '1990-01-01'

df[mask3 | mask4]

In [ ]:
mask5=df['First Name']=='Robert'
mask6=df['Team']=='Client Services'
mask7=df['Start Date']>'2016-06-01'

df[(mask5 & mask6) | mask7]

# isin() method in pandas

In [ ]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

In [ ]:
mask1=df['Team']=='Legal'
mask2=df['Team']=='Sales'
mask3=df['Team']=='Product'

df[mask1 | mask2 | mask3].head()

In [ ]:
#As in above case it is claer that it requires same code for many times so it can be deal with the help of isin() method as in this case we are able to pass multiple arguments

df['Team'].isin(['Legal', 'Sales', 'Product'])

In [ ]:
mask=df['Team'].isin(['Legal', 'Sales', 'Product'])
df[mask] #It is claer that we does not required multiple lines of asme type

# isnull(), notnull() ,between() and duplicate() method in panda

In [ ]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

In [ ]:
#isnull() if you want to extract null values
mask=df['Team'].isnull()
df[mask]

In [ ]:
mask1=df['Team'].isnull()
mask2=df['Gender'].isnull()


df [ mask1 & mask2]
# df[df['Team'].notnull()]

In [ ]:
#between()
# df['Salary'].between(60000, 70000)
df[df['Salary'].between(60000, 70000)]

In [ ]:
df['Bonus %'].between(2.0, 5.0)
df[df['Bonus %'].between(2.0, 5.0)]

In [ ]:
df['Start Date'].between("1991-01-01", "1992-01-01")
df[df['Start Date'].between("1991-01-01", "1992-01-01")]

In [ ]:
#duplicate() method
df.sort_values('First Name', inplace=True)
# df['First Name']=df.sort_values('First Name')
df['First Name']

In [ ]:
df['First Name'].duplicated(keep='last') #it says that first value is not duplicate as in parameter it has keep=first you may change it to last also

In [ ]:
 df[df['First Name'].duplicated(keep=False)].head()

In [ ]:
mask = ~ df[df['First Name'].duplicated(keep=False)].head() #reverse operation of duplicate so ir gives unique value from data sets

In [ ]:
#drop duplicate method\
len(df)

In [ ]:
len(df.drop_duplicates())

In [ ]:
df.drop_duplicates(subset=['First Name'], keep='first')
len( df.drop_duplicates(subset=['First Name'], keep='first'))

In [ ]:
df.drop_duplicates(subset=['First Name', 'Team'], keep='last').head()

# Retrieve row values using loc() method in pandas

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.loc['Casino Royale']

In [ ]:
bond.loc['GoldenEye']

In [ ]:
bond.loc['Casino Royale']

In [ ]:
bond.loc['Diamonds are Forever': 'Moonracker']
bond.loc['GoldenEye':]
bond.loc[: "On Her Majesty's Secret Services"]

In [ ]:
bond.loc[["For Your Eyes Only", "Live and Let Die"]]

#  Retrieve row values using iloc() method in pandas

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv')
bond.head()

In [ ]:
# bond.loc[15]
bond.iloc[15]

In [ ]:
bond.iloc[[15,20]]
bond.iloc[:4]
bond.iloc[4:8]
bond.iloc[0:20:2]

In [ ]:
bond.ix[0] #It shows that ix will be taken data as loc and iloc both

# Second argument of loc and ix methods

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.loc['Moonraker', 'Actor']
# bond.loc['Moonraker', 'Director']
# bond.loc['Moonraker', 'Actor':'Budget']
bond.loc['Moonraker', ['Year', 'Director', 'Budget']]
# #Similarly we can use it with iloc and ix

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
mask=bond['Actor']=='Sean Connery'
bond[mask]

In [ ]:
bond[mask]['Actor']='Sir Sean Connery'

In [ ]:
df2=bond[mask]
df2['Actor']='Sir Sean Connery'
df2

In [ ]:
bond

In [ ]:
bond.ix[mask]
bond.ix[mask,'Actor']='Sir Sean Connery'
bond

# Rename Index Labels or Columns in pandas

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.rename(columns={'Year':'Release date', 'Box Office' : 'Revenue'}, inplace=True)
bond.head()

In [ ]:
bond.rename(index={'Dr. No':'Doctor No', 'GoldenEye':'Golden Eye','The World Is Not Enough': 'Best Bond Movie'})

# Query Methods in Pandas

In [ ]:
#Query methods only applys when all the column are strings and no space in between columns name

import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.columns=[column_names.replace(" ",  "_") for column_names in bond.columns]
bond.head()

In [ ]:
bond.query('Actor=="Sean Connery"')

In [ ]:
bond.query("Director=='Terence Young'")

In [ ]:
bond.query("Actor != 'Roger Moore'")

In [ ]:
bond.query("Box_Office>600")

In [ ]:
bond.query("Actor=='Roger Moore' and Director=='John Glen'")